<!-- это страница приложения как App.js -->

<template>

  <div class="wrapper-content wrapper-content--fixed">
    <div class="container">
      <promo />
      <intro class="intro" title="My last posts:" />
    </div>


    <!-- posts -->
    <postsList :posts="posts" />

  </div>

</template>

<script>
import promo from '@/components/Promo.vue'
import intro from '@/components/UI/Intro.vue'
import postsList from '@/components/Blog/PostsList.vue'

export default {
  components: { promo, intro, postsList },
  data() {
    return {
      posts: [
        {
        id: 1,
        title: 'Небезопасне игрушки',
        descr: 'Надеюсь все уже знают о случаях некроза кишечника из-за проглатывания магнитных шариков. Всё дело в том, что они могут примагничиваться друг к другу в разных отделах кишечника и приводить к затруднению питания тканей, а затем и к отмиранию (некрозу). Это жизнеугрожающее состояние!',
        img: 'https://sun9-5.userapi.com/impg/AoFNcllGDsB7A28KuCYQhQpaf9etRErmIb4iGg/SDb5wL13Zvo.jpg?size=1080x1080&quality=95&sign=860603878709d1da8110729d8bd0cc94&type=album',
        likes: 432,
        },
        {
        id: 2,
        title: 'Половое воспитание',
        descr: 'На приёме я часто сталкиваюсь с тем, что родители стесняются называть половые органы своего ребёнка анатомически правильными именами. Они считают, что это информация не нужна их детям, что они узнают всё сами в положенное для них время (п.с. желательно после 18 лет😂).',
        img: 'https://sun9-18.userapi.com/impg/WvGsmewT6pBCO83Uq54_rseUGyNP9w42r3GN3g/-32RwfRtRFU.jpg?size=1080x1080&quality=95&sign=5964fde154040345677f50f73fec7bd8&type=album',
        likes: 469,
        },
        {
        id: 3,
        title: 'Про сорбенты',
        descr: '💁🏻‍♀За сорбенты. Не буду перечислять их названия, вы и так знаете, расскажу лишь одно, так ли они нужны в первую очередь🤔',
        img: 'https://sun9-80.userapi.com/impg/4umvQVwJ88OfCKh9U-DphW9AbNGTUDfoX71mWw/ahFUn8eYihI.jpg?size=1080x1080&quality=95&sign=2feef7e86856cf931f067fdcf661d115&type=album',
        likes: 517,
        }
      ]
    }
  }
}
</script>
